Revit 2026 API

# LayoutRule Properties

---

The LayoutRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

#### Reference

LayoutRule Class

Autodesk.Revit.DB Namespace